# Data Visualization using Pandas

## Importing the necessary libraries

In [2]:
import pandas as pd
import numpy as np

## Intro to Dataframes

In [5]:
df = pd.DataFrame([[1,2],[4,5],[6,7]])
df

   0  1
0  1  2
1  4  5
2  6  7

In [ ]:
df = pd.DataFrame([[1,2],[4,5],[6,7]], columns = ["A","B"])
df

   A  B
0  1  2
1  4  5

In [18]:
df = pd.DataFrame([[1,2],[4,5],[6,7]], columns = ["A","B"], index=["x","y","z"])
df

   A  B
x  1  2
y  4  5
z  6  7

In [19]:
df.columns

Index(['A', 'B'], dtype='object')

In [20]:
df.index

Index(['x', 'y', 'z'], dtype='object')

### **Indices are the rows and columns are columns**
#### You can use .tolist after index and columns to get it in list format

In [29]:
df.index.tolist()

['x', 'y', 'z']

In [28]:
df.columns.tolist()

['A', 'B']

In [23]:
df.head()

   A  B
x  1  2
y  4  5
z  6  7

#### df.head() only gives the first 3 data rows

In [24]:
df.head(1)

   A  B
x  1  2

In [25]:
df.head(2)

   A  B
x  1  2
y  4  5

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

#### Gives information regarding the dataframe

In [30]:
df.describe()

              A         B
count  3.000000  3.000000
mean   3.666667  4.666667
std    2.516611  2.516611
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.000000  6.000000
max    6.000000  7.000000

#### Gives meaningful information regarding the dataframe

In [31]:
df.nunique()

A    3
B    3
dtype: int64

#### Gives the number of non unique values in each row
#### can be specfically done on one row as well as shown

In [32]:
df['A'].nunique()

3

In [33]:
df['A'].unique()

array([1, 4, 6], dtype=int64)

In [35]:
df.shape

(3, 2)

#### Gives the shape of the dataframe

In [36]:
df.size

6

#### Total Number of spaces ( no. of rows multiplied by no. of columns)

## To import the dataset from the excel file to the dataframe from PANDAS

In [4]:
df = pd.read_csv('JEE_Dropout_After_Class_12.csv', delimiter=',')
df.head()

,jee_main_score,jee_advanced_score,mock_test_score_avg,school_board,class_12_percent,attempt_count,coaching_institute,daily_study_hours,family_income,parent_education,location_type,peer_pressure_level,mental_health_issues,admission_taken,dropout
0,78.95,59.22,59.86,CBSE,70.09,1,FIITJEE,5.4,Low,Upto 10th,Urban,Low,No,No,1
1,70.06,58.75,64.33,State,78.00,1,FIITJEE,5.5,Mid,Upto 10th,Urban,Low,Yes,No,0
2,81.07,37.27,60.83,ICSE,64.36,1,FIITJEE,7.0,Low,PG,Semi-Urban,Medium,Yes,No,1
3,93.32,60.72,69.33,ICSE,73.21,1,FIITJEE,2.1,Low,12th,Semi-Urban,Medium,Yes,Yes,0
4,68.72,77.73,82.37,CBSE,89.02,1,Allen,6.3,Mid,Graduate,Semi-Urban,High,No,Yes,0

#### pd.read_csv reads the csv file and enters it into a Dataframe called "df" and if it is a text file, instead of the delimiter being ',', you can put '\t'